[
  {
    "id": "img1",
    "category": "Marvel",
    "name": "Avenger Infinity War",
    "sku": "num_1234",
    "price": 800,
    "image": "https://media.comicbook.com/2017/09/avengers-infinity-war-by-themadbutcher-dbo60d8-1-1022419.jpg",
    "description": "Avengers: Infinity War is a 2018 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sequel to The Avengers (2012) and Avengers: Age of Ultron (2015), and the 19th film in the Marvel Cinematic Universe (MCU).",
    "currency": "CAD"
  },
  {
    "id": "img2",
    "category": "Magic",
    "name": "Harry Potter Deathly Hallows Part 2",
    "sku": "num_1526",
    "price": 525,
    "image": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcTgXSuLAFerQGZdPCWv8EHI_ucQq6RTl3xf91F4aN54PDA_oCtB",
    "description": "Harry Potter and the Deathly Hallows – Part 2 is a 2011 fantasy film directed by David Yates and distributed by Warner Bros. Pictures.[4] It is the second of two cinematic parts based on J. K. Rowling's 2007 novel of the same name and the eighth and final instalment in the Harry Potter film series.",
    "currency": "CAD"
  },
  {
    "id": "img3",
    "category": "Sci-Fci",
    "name": "Star Wars: Episode VI – Return of the Jedi",
    "sku": "num_1289",
    "price": 700,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRnTSmH4ckpqTGuLeBlI6DEnAagQq1Oha9c8fDlm2SRbcpEKZK0",
    "description": "Return of the Jedi (also known as Star Wars: Episode VI – Return of the Jedi) is a 1983 American epic space opera film directed by Richard Marquand. The screenplay is by Lawrence Kasdan and George Lucas from a story by Lucas, who was also the executive producer. It is the third installment in the original Star Wars trilogy and the third film to be produced",
    "currency": "CAD"
  },
  {
    "id": "img4",
    "category": "Marvel",
    "name": "Avengers Endgame",
    "sku": "num_7685",
    "price": 1000,
    "image": "https://upload.wikimedia.org/wikipedia/en/0/0d/Avengers_Endgame_poster.jpg",
    "description": "Avengers: Endgame is a 2019 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the direct sequel to Avengers: Infinity War (2018) and the 22nd film in the Marvel Cinematic Universe (MCU).",
    "currency": "CAD"
  },
  {
    "id": "img5",
    "category": "DC",
    "name": "Batman - The Dark Knight ",
    "sku": "num_4982",
    "price": 450,
    "image": "https://upload.wikimedia.org/wikipedia/en/8/8a/Dark_Knight.jpg",
    "description": "The Dark Knight is a 2008 superhero film directed, produced, and co-written by Christopher Nolan. Based on the DC Comics character Batman, the film is the second installment of Nolan's The Dark Knight Trilogy and a sequel to 2005's Batman Begins",
    "currency": "CAD"
  },
  {
    "id": "img6",
    "category": "Sc-Fci",
    "name": "Star Wars: The Force Awakens",
    "sku": "num_8324",
    "price": 650,
    "image": "https://cdn.vox-cdn.com/thumbor/yU6moEPwRehSjicaQ912ebJLpDE=/0x0:1536x864/1400x1400/filters:focal(337x270:581x514):format(jpeg)/cdn.vox-cdn.com/uploads/chorus_image/image/48434499/tfa_poster_wide_header-1536x864-324397389357.0.0.jpg",
    "description": "Star Wars: The Force Awakens (also known as Star Wars: Episode VII – The Force Awakens) is a 2015 American epic space opera film produced, co-written, and directed by J. J. Abrams. Produced by Lucasfilm and Abrams' production company Bad Robot Productions, and distributed by Walt Disney Studios Motion Pictures, it is the first installment in the Star Wars sequel trilogy, following Return of the Jedi (1983).",
    "currency": "CAD"
  }
]